{
    "projects": {
        "inception-poster": {
            "title": "Inception Poster",
            "intro": "Voor dit project heb ik een dynamische poster gemaakt voor de film Inception, geregisseerd door Christopher Nolan. Het doel was om de surrealistische en complexe thema's van de film te vangen in een visueel aantrekkelijke en bewegende poster.",
            "phases": [
                {
                    "title": "Film Research",
                    "description": "De film volgt Dom Cobb, een ervaren dief die gespecialiseerd is in het stelen van waardevolle informatie uit de diepste lagen van het menselijk onderbewustzijn. Wat deze film zo uniek maakt, is de manier waarop het de complexiteit van dromen en realiteit verkent.",
                    "image": "images/film-research.jpg"
                },
                {
                    "title": "Regisseur Research - Christopher Nolan",
                    "description": "Christopher Nolan, geboren op 30 juli 1970 in Londen, is een regisseur die bekend staat om zijn diepgaande en intrigerende films. Zijn opvallende werken, zoals 'Memento', 'The Prestige' en 'Inception', hebben hem wereldwijde erkenning opgeleverd.",
                    "image": "images/nolan-research.jpg"
                },
                {
                    "title": "Origineel Idee",
                    "description": "Voor dit filmaffiche heb ik ervoor gekozen om een scène te illustreren die geïnspireerd is op een memorabele sequentie uit Inception. In deze scène zie je een gebouw dat ronddraait, terwijl een personage naar beneden valt. Dit beeld van een eindeloze val heeft me geïnspireerd om een vergelijkbaar gevoel van surrealistische beweging te creëren voor het affiche.",
                    "image": "images/original-idea.jpg"
                },
                {
                    "title": "Inhoud van de Affiche",
                    "description": "Film Titel: Inception, Regisseur: Christopher Nolan, Acteurs en Actrices: Leonardo DiCaprio, Ken Watanbe, Ellen Page, Tom Hardy, Productiehuis: Warner Bros. Pictures, Credits: 'WARNER BROS. PICTURES PRESENTS IN ASSOCIATION WITH LEGENDARY PICTURES A SYNCOPY PRODUCTION A FILM BY CHRISTOPHER NOLAN LEONARDO DICAPRIO 'INCEPTION' KEN WATANABE JOSEPH GORDON-LEVITT MARION COTILLARD ELLEN PAGE TOM HARDY CILLIAN MURPHY TOM BERENGER AND MICHAEL CAINE MUSIC by HANS ZIMMER EDITED by LEE SMITH, ACE. PRODuction deSIGNER by HENDRIX DYAS'"
                },
                {
                    "title": "Stijl, Kleur, Typografie en Beweging",
                    "description": "Voor het filmaffiche heb ik gekozen voor een minimalistische stijl, die de essentie van Inception weerspiegelt. De kleurenpaletten die ik heb gebruikt zijn rechtstreeks geïnspireerd op de film zelf, met tonen zoals #DF2318, #085871, en #29414B. Wat betreft typografie, heb ik gekozen voor de font 'Gotham' in zowel light als bold varianten en 'Bebas Neue' voor de credits. De bewegingselementen zijn subtiel toegevoegd om de dynamiek van de droomwereld van Inception te versterken.",
                    "image": "images/style-color.jpg"
                },
                {
                    "title": "Moodboard",
                    "image": "images/moodboard.jpg"
                },
                {
                    "title": "Statische Ontwerpen",
                    "description": "Ontwerp 1: Een figuur die naar beneden valt, omringd door spiegels en zwevende betonnen muren. Ontwerp 2: Een object dat in de film wordt gebruikt om te controleren of iemand droomt. Het object draait continu om de droomstaat aan te geven. Ontwerp 3: Een wereld die ondersteboven wordt weergegeven, gecombineerd met een persoon die valt, wat een oneindige loop van vallen simuleert.",
                    "image": "images/static-designs.jpg"
                },
                {
                    "title": "Varianten Digitaal Ontwerp",
                    "image": "images/digital_variations.jpg"
                },
                {
                    "title": "Digitaal Ontwerp",
                    "description": "Voor het digitaal ontwerp heb ik gekozen om verder te werken aan Ontwerp 3, vanwege de technische haalbaarheid met CSS en het interessante concept van een eindeloze val.",
                    "image": "images/final_digital_design.jpg"
                },
                {
                    "title": "HTML en CSS Conversie",
                    "description": "Ik heb de basisstructuur van de webpagina opgezet en de SVG-code van mijn filmaffiche geëxporteerd uit Figma en toegevoegd aan het HTML-bestand. Met behulp van CSS-transformaties en overgangen heb ik de beweging van de gebouwen en de vallende figuur geanimeerd, met aandacht voor timing en easing om de animatie zo levensecht mogelijk te maken."
                }
            ]
        },
        "zen-garden": {
            "title": "CSS Zen Garden",
            "intro": "Voor de CSS Zen Garden uitdaging heb ik een gothic-stijl pagina gemaakt. Het doel was om alleen de CSS aan te passen zonder de HTML te wijzigen, met een interactieve Notre Dame als thema waar je goed moet zoeken waar de teksten liggen.",
            "phases": [
                {
                    "title": "Thema Research",
                    "description": "Gothic Architectuur floreerde voornamelijk tijdens de middeleeuwen, van de 12e tot de 16e eeuw, en wordt gekenmerkt door zijn indrukwekkende elementen zoals spitsbogen, ribgewelven, luchtbogen en roosvensters.",
                    "image": "images/gothic-research.jpg"
                },
                {
                    "title": "Moodboard",
                    "description": "Mijn moodboard is samengesteld uit een verscheidenheid aan afbeeldingen die dienen als inspiratie voor mijn ontwerp binnen het thema Gothic Architectuur.",
                    "image": "images/gothic-moodboard.jpg"
                },
                {
                    "title": "Stijl, Kleur, Typografie en Beweging",
                    "description": "Voor mijn CSS ZenGarden redesign heb ik ervoor gekozen om een minimalistische stijl te hanteren, die de essentie van de gotische architectuur weerspiegelt. De kleurenpaletten die ik heb gebruikt zijn geïnspireerd op de duistere, intrigerende sfeer van de gotiek.",
                    "image": "images/style-color.jpg"
                },
                {
                    "title": "Inspiratie beelden",
                    "description": "Gargoyle Foto's, grafstenen met tekst en foto's van de Notre Dame hebben bijgedragen aan het vormgeven van belangrijke componenten van mijn ontwerp.",
                    "image": "images/inspiration-images.jpg"
                },
                {
                    "title": "Wireframes",
                    "description": "Wireframes zijn gemaakt om de structuur en lay-out van de pagina te plannen voordat de definitieve ontwerpdetails werden toegevoegd.",
                    "image": "images/wireframes.jpg"
                },
                {
                    "title": "CSS Conversie",
                    "description": "Ik ben begonnen met het instellen van de Notre Dame die ik heb ontworpen en getekend als achtergrond van de body in CSS. Dit zorgt voor een imposante en sfeervolle achtergrond die de gotische sfeer van mijn ontwerp benadrukt.",
                    "image": "images/css-conversion.jpg"
                },
                {
                    "title": "Github",
                    "description": "Bekijk de volledige code op GitHub.",
                    "image": "images/github.jpg",
                    "link": "https://github.com/Bakbak24/zengarden_challenge"
                }
            ]
        }
    }
}